# 연습문제 01

# 01. 아래는 홍길동 과목별 점수. 평균 점수 구하기
# 과목 | 점수
# 국어 | 80
# 영어 | 75
# 수학 | 55
print()
print("====================================================================================")
print()
print("01. 아래는 홍길동 과목별 점수. 평균 점수 구하기")
k = 80
e = 75
m = 55
result = ( k + e + m) / 3
print("result ? ", result); 
print()

print("====================================================================================")
print()
print("02. 자연수 13이 홀수인지 짝수인지 판별하는 방법")
num = 13 
isOdd = 13 % 2 == 1
result = "짝수" if isOdd else "홀수"
print("result ? ", result)
print()

# 홍길동 주민등록번호는 881120-1068234.
# 홍길동 주민번호를 앞번호/뒷번호로 나누어 출력.
print("====================================================================================")
print()
print("03. 홍길동 주민등록번호(881120-1068234)를 앞번호/뒷번호로 나누어 출력")
pin = "881120-1068234"
# answer 1 
yyyymmdd = pin[:6]
# answer 2
num = pin[7:]
print("yyyymmdd ? ", yyyymmdd)
print("num ? ", num)
print()

# 주민번호에서 성별을 나타내는 숫자 표현.
print("====================================================================================")
print()
print("04. 주민번호에서 성별을 나타내는 숫자 표현.")
pin = "881120-1068234"
# anwswer
result = pin[7:8]
print("result : ", result)
print()

# "a:b:c:d" 문자열 존재.
# replace 함수 사용하여 "a#b#c#d"로 변경
print("====================================================================================")
print()
print("05. \"a:b:c:d\" 문자열을 replace 함수 사용하여 \"a#b#c#d\"로 변경")
pin = "a:b:c:d"
# anwswer
result = pin.replace(":", "#")
print("result : ", result)
print()

# [1,3,5,4,2] 리스트를 [5,4,3,2,1] 로 변경하기
print("====================================================================================")
print()
print("06. [1,3,5,4,2] 리스트를 [5,4,3,2,1] 로 변경")
a = [1,3,5,4,2]
# [1,2,3,4,5] 로 변경
a.sort()
print("a.sort() : ", str(a))
# [5,4,3,2,1] 로 변경
a.reverse()
print("a.reverse() : ", str(a))
print("result : ", str(a))
print()


# ⭐ ['Life', 'is', 'too', 'short'] 리스트를 Life is too short 문자열로 출력.
print("====================================================================================")
print()
print("⭐ 07. ['Life', 'is', 'too', 'short'] 리스트를 Life is too short 문자열로 출력.")
a = ['Life', 'is', 'too', 'short']
result = " ".join(a)
print("result : ", result)
print()

# ⭐ (1,2,3) 튜플에 값 4를 추가하여 (1,2,3,4) 만들기기
print("====================================================================================")
print()
print("⭐ 08. (1,2,3) 튜플에 값 4 추가")
a = (1,2,3)
# a.index[3] = 4 (오답)
# 4, 로 추가... 왜?? 
b = (4, )
result = a + b
print("result : ", str(result))
print()

# 다음 중 오류 발생하는 경우. 
print("====================================================================================")
print()
print("09. 다음 중 오류 발생하는 경우. ")
print("① a['name'] = 'python'")
print("② a[('a', )] = 'python'")
print("③ a[[1]] = 'python'")
print("④ a[250] = 'python'")
a = dict()
a
a['name'] = 'python'
a[('a', )] = 'python'
# a[[1]] = 'python'
a[250] = 'python'
result = "③"
reason = "리스트 형은 Key 로 설정하지 못함."
print(f"정답 : {result}, 이유: {reason}")
print()

# 딕셔너리 a에서 'B'를 추출하는 방법
print("====================================================================================")
print()
print("10. 딕셔너리 a에서 'B'를 추출하는 방법")
a = {'A' : 90, 'B' : 80, 'C' : 70}
result = a['B']
print("a : ", a)
print("result : ", result)
print()

# ⭐ a 리스트에서 중복 숫자 제거
print("====================================================================================")
print()
print("⭐ 11. a 리스트에서 중복 숫자 제거")
a = [1,1,1,2,2,3,3,3,4,4,5]
aSet = set(a)
result = list(aSet)
# ⭐ set 에서 리스트 형.
print("a : ", str(a))
print("aSet : ", str(aSet))
print("result : ", str(result))
print()

# ⭐ a = b = [1,2,3] 아래의 결과로 b의 값과 이유는는
print("====================================================================================")
print()
print("⭐ 12. b의 값과 그 값이 나오는 이유")
a = b = [1,2,3]
a[1] = 4
# a, b 모두 [1,4,3]
print("b : ", str(b))
result = [1,4,3]
print(f"result : {result}, 이유 : id 를 비교하면 이는 동일하고 둘은 동일한 객체를 바라보고 있기 때문.")
print()